Catalogs/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Задача</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БП_Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.БП_Оповещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СогласованиеМассиваДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Comment>История переписки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гиперссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьФорму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Новая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДелегировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбязательныйКПрикреплению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДГруппы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СогласованиеОбщее</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаявкиАдминистратору</v8:Type>
						<v8:Type>cfg:CatalogRef.УтверждениеБюджета</v8:Type>
						<v8:Type>cfg:CatalogRef.Согласование2</v8:Type>
						<v8:Type>cfg:CatalogRef.Согласование1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗаявкиАдминистраторуТочкиМаршрута</v8:Type>
						<v8:Type>cfg:EnumRef.СогласованиеОбщееТочкиМаршрута</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.Согласование3ТочкиМаршрута</v8:Type>
						<v8:Type>cfg:EnumRef.УтверждениеБюджетаТочкиМаршрута</v8:Type>
						<v8:Type>cfg:EnumRef.Согласование2ТочкиМаршрута</v8:Type>
						<v8:Type>cfg:EnumRef.Согласование1ТочкиМаршрута</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/БП_ДелегированиеЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>БП_ДелегированиеЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПеренаправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Замещающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Делигирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/БП_Оповещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>БП_Оповещение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стартован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гиперссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьФорму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГиперссылкаСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСсылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокИсполнителей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Задача/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") И (БПСервер.ТекПользовательИсполнительЗадачи(Параметры.Ключ) ИЛИ НЕ ПараметрыСеанса.ДоступныеПользователи.Найти(Параметры.Ключ.Автор) = Неопределено) Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Справочник.Задача.Форма.ФормаЗадачи";
		ТекЗадача = Параметры.Ключ;
		ТекЗаявка = ТекЗадача.Заявка;
		БПСервер.СнятьПометкуНовая(ТекЗадача);
		
		Если НЕ ЗначениеЗаполнено(ТекЗаявка) Тогда
			Если НЕ ТекЗадача.Выполнена Тогда
				ВыбраннаяФорма = "Справочник.Задача.Форма.ФормаЗадачиОбщая";
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		Если ТекЗадача.Выполнена Тогда
			Возврат;		
		КонецЕсли;
		
		Попытка
			ТекИмяФорма = "";
			ТекПараметры = Неопределено;
			Если ТипЗнч(ТекЗаявка) = Тип("ДокументСсылка.БП_Поручение") Тогда //если открываем поручение (документ)
				ИмяФормыПоручения = УзнатьФорму(ТекЗаявка, ТекЗадача);
				ТекИмяФорма = ИмяФормыПоручения;
				ТекПараметры = Новый Структура("Ключ", ТекЗадача);
			ИначеЕсли ТипЗнч(ТекЗаявка) = Тип("СправочникСсылка.Контрагенты") И ЛЕВ(ТекЗадача.Описание, 4) = "ИНН:" Тогда
				ТекИмяФорма = "Справочник.Контрагенты.Форма.ФормаБПСогласования";
				ТекПараметры = Новый Структура("Ключ", ТекЗадача);
			ИначеЕсли ТипЗнч(ТекЗаявка) = Тип("ДокументСсылка.БП_Оповещение") Тогда
				ТекИмяФорма = "Документ.БП_Оповещение.Форма.ФормаИсполнения";
				ТекПараметры = Новый Структура("Ключ", ТекЗадача);
			ИначеЕсли ТипЗнч(ТекЗаявка) = Тип("СправочникСсылка.сабОтпускаСотрудников") Тогда
				ИмяФормыОтпуска = УзнатьФормуОтпуска(ТекЗадача, ТекЗаявка);
				ТекИмяФорма = ИмяФормыОтпуска;
				ТекПараметры = Новый Структура("Ключ", ТекЗаявка);
			//ИначеЕсли ТипЗнч(ТекЗаявка) = Тип("СправочникСсылка.ОпознаваниеПлатежей") Тогда
			//	ПараметрыФормыОтпуска = ОпределитьФормуСогласования(ТекЗадача);
			//	ТекИмяФорма = ПараметрыФормыОтпуска.ТекФорма;
			//	ТекПараметры = ПараметрыФормыОтпуска;
				//ИначеЕсли ТипЗнч(Элементы.Список.ТекущиеДанные.Заявка) = Тип("ДокументСсылка.Д_ЗаявкаНаДоставку") Тогда
				//	ПараметрыФормыДоставки = ОпределитьФормуДоставки(ТекЗадача);
				//	ТекИмяФорма = ПараметрыФормыДоставки.ТекФорма;
				//	ТекПараметры = ПараметрыФормыДоставки;
			ИначеЕсли ТипЗнч(ТекЗаявка) = Тип("СправочникСсылка.Должности") Или ТипЗнч(ТекЗаявка) = Тип("СправочникСсылка.Номенклатура") Или
				ТипЗнч(ТекЗаявка) = Тип("СправочникСсылка.Контрагенты") Или ТипЗнч(ТекЗаявка) = Тип("СправочникСсылка.Организации") Тогда
				ТекИмяФорма = "ОбщаяФорма.ФормаПроверкиОбъектовБД";
				ТекПараметры = Новый Структура("Ключ", ТекЗадача);
			Иначе
				//если открыываем БП
				
				//ПараметрыФормы = ОпределитьНужнуюФорму(ТекЗадача);
				//ИмяФормыВыполненияСправочники = "";
				//Результат = ПараметрыФормы.Свойство("ИмяФормы", ИмяФормыВыполненияСправочники);
				//Если Результат Тогда
				//	ТекИмяФорма = ИмяФормыВыполненияСправочники;
				//	ТекПараметры = ПараметрыФормы.ПараметрыФормы;
				//КонецЕсли;
				// используем универсальную форму!!!
				
				ТекИмяФорма = "Справочник.Задача.Форма.ФормаУниверсальнаяНовая";
				
			Конецесли;
			
			ВыбраннаяФорма = ТекИмяФорма;
			
			//ТекФорма = ПолучитьФорму(ТекИмяФорма, ТекПараметры);
			////ТекФорма.Объект.Новая = Ложь;
			////ТекФорма.Записать();
			//ТекФорма.Открыть();
			//ТекФорма.ОбновитьОтображениеДанных();
			
		Исключение
			Сообщить("Ошибка открытия. Обратитесь к администратору");
		КонецПопытки;
		//Иначе
		//	Если БюджетныйНаСервере.РольАдминаДоступнаСервер() Тогда
		//		ВыбраннаяФорма = "Справочник.Задача.Форма.СписокМоихЗадач1"; 
		//		
		//	
		//	КонецЕсли;
	ИначеЕсли  ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Основание") Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Справочник.Задача.Форма.ФормаЗадачиОбщая";	
	КонецЕсли;
КонецПроцедуры

Функция УзнатьФорму(Поручение, ТекЗадача)
	
	ТекМассивПользователей = ПараметрыСеанса.ДоступныеПользователи;
	ИмяФормыПоручения = "Документ.БП_Поручение.Форма.ФормаИсполнения";		
	//ИмяФормыПоручения = "Документ.БП_Поручение.Форма.ФормаКонтроля";
	//Для каждого ТекИсполнитель Из Поручение.СписокИсполнителей Цикл
	Если НЕ ТекМассивПользователей.Найти(Поручение.Автор) = Неопределено Тогда
		Если НЕ (не ТекМассивПользователей.Найти(ТекЗадача.Автор) = Неопределено И БПСервер.ТекПользовательИсполнительЗадачи(ТекЗадача)) Тогда //в случае если автор сам ставит себе Справочники
			ИмяФормыПоручения = "Документ.БП_Поручение.Форма.ФормаКонтроля";
		КонецЕсли;
		//ИмяФормыПоручения = "Документ.БП_Поручение.Форма.ФормаИсполнения";		
		//Прервать;
	КонецЕсли;	
	//КонецЦикла; 
	Возврат ИмяФормыПоручения;
	
КонецФункции // ()

Функция УзнатьФормуОтпуска(Задача, Отпуск)
	ТекМассивПользователей = ПараметрыСеанса.ДоступныеПользователи;
	ИмяФормыОтпуска = "Справочник.сабОтпускаСотрудников.Форма.ФормаЗамещающего";
	Если Задача.Исполнитель = Отпуск.Пользователь Тогда
		ИмяФормыОтпуска = "Справочник.сабОтпускаСотрудников.Форма.ФормаЭлемента";	
	КонецЕсли;
	Для каждого ТекСогласователь Из Отпуск.ДопСогласование Цикл
		Если НЕ ТекМассивПользователей.Найти(ТекСогласователь.СубъектСогласования) = Неопределено И НЕ ТекСогласователь.Согласовано Тогда// И НЕ ТекСогласователь.Пройден Тогда
			ИмяФормыОтпуска = "Справочник.сабОтпускаСотрудников.Форма.ФормаСогласования";		
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат ИмяФормыОтпуска;
КонецФункции // ()

Функция ОпределитьФормуСогласования(ТекСтрока)
	МассивПользователей = ПараметрыСеанса.ДоступныеПользователи;
	ТекФорма = "Справочник.ОпознаваниеПлатежей.ФормаОбъекта";
	ТекКлюч = ТекСтрока.Заявка;
	Если НЕ МассивПользователей.Найти(ТекСтрока.Исполнитель) = Неопределено ИЛИ (МассивПользователей.Найти(ТекСтрока.Заявка.Опознаватель) = Неопределено И НЕ МассивПользователей.Найти(ТекСтрока.Исполнитель) = Неопределено) Тогда
		ТекФорма = "Справочник.ОпознаваниеПлатежей.Форма.ФормаСогласования";
	КонецЕсли;
	Возврат Новый Структура("Ключ, ТекЗадача, ТекФорма", ТекКлюч, ТекСтрока, ТекФорма); 
КонецФункции // ()

Функция ОпределитьНужнуюФорму(ЗадачаСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.БизнесПроцесс,
	|	Таблица.ТочкаМаршрута,
	|	Таблица.Должность,
	|	БП_ДелегированиеЗадач.Замещающий КАК Исполнитель
	|ИЗ
	|	Справочник.Задача КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БП_ДелегированиеЗадач КАК БП_ДелегированиеЗадач
	|		ПО Таблица.Ссылка = БП_ДелегированиеЗадач.Задача
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЗадачаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("БизнесПроцесс,ТочкаМаршрута");
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	Если Реквизиты.БизнесПроцесс = Неопределено ИЛИ Реквизиты.БизнесПроцесс.Пустая() Тогда
		Возврат Новый Структура();
	КонецЕсли;
	
	ТипБизнесПроцесса = Метаданные.НайтиПоТипу(ТипЗнч(Реквизиты.БизнесПроцесс));
	
	ПараметрыФормы = Справочники[ТипБизнесПроцесса.Имя].ФормаВыполненияСправочники(ЗадачаСсылка,
	Реквизиты.ТочкаМаршрута, Выборка);
	Возврат ПараметрыФормы;
	
КонецФункции
